# NumberOfLines Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LayoutRuleFixedNumber..::..NumberOfLines Property
LayoutRuleFixedNumber Class See Also
---
Get or set the number of the beams in a beam system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumberOfLines { get; set; }
```

Visual Basic
---
```text
Public Property NumberOfLines As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int NumberOfLines {
	int get ();
	void set (int value);
}
```

# Remarks
The number must be positive.
# See Also
LayoutRuleFixedNumber Class
Autodesk.Revit.DB Namespace